app/controllers/posts_controller.rb

SELECT "posts".* FROM "posts"
---
  def index
    @posts = Post.paginate :per_page => 10, :page => params[:page], :order => "created_at DESC"

SELECT "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT 1  [["id", "1"]]
SELECT "users".* FROM "users" WHERE "users"."id" = 1 LIMIT 1
---
  def show
    @post = Post.find(params[:id], :include => [:user, :children])

INSERT INTO "posts" ("content", "created_at", "parent_id", "shadow_id", "updated_at", "user_id", "view_count") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"
---
  def create
    @post = current_user.posts.build(params[:post])
    @parent_post = Post.find(params[:post][:parent_id]) if params[:post][:parent_id]

    respond_to do |format|
      if @post.save

SELECT "posts".* FROM "posts" WHERE "posts"."user_id" = 1 AND "posts"."id" = $1 LIMIT 1  [["id", "1"]]
UPDATE "posts" SET "content" = 'post 2', "updated_at" = '2012-07-22 14:54:36.916299' WHERE "posts"."id" = 1
UPDATE "users" SET "updated_at" = '2012-07-22 14:54:36.919199' WHERE "users"."id" = 1
---
  def update
    @post = current_user.posts.find(params[:id])

    respond_to do |format|
      if @post.update_attributes(params[:post])

SELECT "posts".* FROM "posts" WHERE "posts"."user_id" = 1 AND "posts"."id" = $1 LIMIT 1  [["id", "1"]]
DELETE FROM "posts" WHERE "posts"."id" = $1  [["id", 1]]
---
  def destroy
    unless current_user.name == "derk"
      @post = Post.find(params[:id])
    else
      @post = current_user.posts.find(params[:id])
    end
    @post.destroy