app/controllers/tags_controller.rb

SELECT "tags".* FROM "tags" WHERE (LOWER(name) like 'post') LIMIT 1
---
  def show
    items_per_page = 30
    tagname = params[:id].present? ? params[:id].downcase : ""
    @tag = Tag.find(:first, :conditions => ["LOWER(name) like ?", tagname]) || raise(ActiveRecord::RecordNotFound, "Couldn't find tag #{tagname}")